{
  "architectures": [
    "NVLlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "llama3_nv.NVLlamaConfig",
    "AutoModel": "llama3_nv.NVLlamaModel",
    "AutoModelForCausalLM": "llama3_nv.NVLlamaForCausalLM",
    "AutoModelForQuestionAnswering": "llama3_nv.NVLlamaForQuestionAnswering",
    "AutoModelForSequenceClassification": "llama3_nv.NVLlamaForSequenceClassification",
    "AutoModelForTokenClassification": "llama3_nv.NVLlamaForTokenClassification"
  },
  "dtype": "bfloat16",
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 6,
  "num_hidden_layers": 2,
  "num_key_value_heads": 6,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 32.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "vocab_size": 256,
  "bos_token_id": 2,
  "eos_token_id": 0,
  "pad_token_id": 1,
  "attn_input_format": "bshd"
}
